In [1]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
# NaN 값은 세지 않음
s.count()

9

In [5]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [6]:
# 각 열마다 별도로 데이터 갯수를 센다. 데이터에서 값이 누락된 부분을 찾을 때 유용하다.
df.count()

0    4
1    4
2    4
3    3
dtype: int64

### 연습 문제 4.2.5
--------------

다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

```python
import seaborn as sns

titanic = sns.load_dataset("titanic")
```
타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [7]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic["age"][:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [8]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100)+1)
s2.tail()

95    5
96    6
97    3
98    5
99    4
dtype: int32

In [9]:
s2.value_counts()

2    22
1    18
5    17
6    16
4    14
3    13
dtype: int64

In [10]:
# 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

In [11]:
s2.value_counts().sort_index()

1    18
2    22
3    13
4    14
5    17
6    16
dtype: int64

In [12]:
s.sort_values().sort_index()

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [13]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [14]:
df.sort_values(by=[0,3])

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0


### 연습 문제 4.2.6
-----------
타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [15]:
print(titanic["sex"].value_counts())
print(titanic["age"].value_counts().sort_index())
print(titanic["class"].value_counts())
print(titanic["alive"].value_counts())

male      577
female    314
Name: sex, dtype: int64
0.42      1
0.67      1
0.75      2
0.83      2
0.92      1
1.00      7
2.00     10
3.00      6
4.00     10
5.00      4
6.00      3
7.00      3
8.00      4
9.00      8
10.00     2
11.00     4
12.00     1
13.00     2
14.00     6
14.50     1
15.00     5
16.00    17
17.00    13
18.00    26
19.00    25
20.00    15
20.50     1
21.00    24
22.00    27
23.00    15
         ..
44.00     9
45.00    12
45.50     2
46.00     3
47.00     9
48.00     9
49.00     6
50.00    10
51.00     7
52.00     6
53.00     1
54.00     8
55.00     2
55.50     1
56.00     4
57.00     2
58.00     5
59.00     2
60.00     4
61.00     3
62.00     4
63.00     2
64.00     2
65.00     3
66.00     1
70.00     2
70.50     1
71.00     2
74.00     1
80.00     1
Name: age, Length: 88, dtype: int64
Third     491
First     216
Second    184
Name: class, dtype: int64
no     549
yes    342
Name: alive, dtype: int64

In [16]:
titanic[titanic["age"] < 1]
titanic.index.name = "number"
titanic.columns.name = "분류"

In [17]:
titanic.head()

분류,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
number,,,,,,,,,,,,,,,
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 행열 합계
행과 열의 합계를 구할 때는
```python
sum(axis)
```
메서드를 사용

In [18]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [19]:
df2.sum(axis=1).sort_values()

1    34
0    35
2    41
3    42
dtype: int64

In [20]:
df2.sum()

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [21]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [22]:
df2.loc["ColTotal", :] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

### apply 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때는 `apply()` 메서드를 사용한다. 인수로 행 또는 열을 받는 함수를 `apply(function lambda)` 메서드의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용시킨다.$

In [33]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [28]:
print(df3.apply(lambda x: x.max() - x.min()))
print(df3.apply(lambda x: x.max() - x.min(), axis=1))

A    3
B    2
C    4
dtype: int64
0    1
1    2
2    3
3    2
4    1
dtype: int64

In [41]:
df3.apply(pd.value_counts)
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [30]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]

### 실수 값을 카테고리 값으로 변환
실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 때는 다음과 같은 명령을 사용한다.

* cut: 실수 값의 경계선을 지정하는 경우
* qcut: 갯수가 똑같은 구간으로 나누는 경우

In [5]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
print(cats)
print(type(cats))
print(cats.codes)

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]
<class 'pandas.core.arrays.categorical.Categorical'>
[-1  0  0  1  1  3  2  4  1  3  2 -1]

In [4]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [7]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q3, Q1, Q1, Q2, Q3, ..., Q4, Q2, Q3, Q1, Q4]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [8]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

### 연습 문제 4.2.7
-----
```
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다. 

(각 그룹 별로 비율의 전체 합은 1이 되어야 한다.)

In [36]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [38]:
cats_t = pd.cut(titanic["age"], bins, labels= labels)

In [41]:
titanic["그룹"] = cats_t

In [47]:
titanic_survived = titanic[titanic['survived']==1]
titanic_death = titanic[titanic['survived']==0]

In [54]:
titanic_death["그룹"].value_counts()/titanic_death["그룹"].count()

청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: 그룹, dtype: float64

In [55]:
titanic_survived["그룹"].value_counts()/titanic_survived["그룹"].count()

중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: 그룹, dtype: float64

In [60]:
# 검증
print((titanic_survived["그룹"].value_counts()/titanic_survived["그룹"].count()).sum())
print((titanic_death["그룹"].value_counts()/titanic_death["그룹"].count()).sum())

0.9999999999999999
0.9999999999999999